configuration.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Configuration</title>
<!-- 2017-02-13 Mon 12:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Maxfield Lehman" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. General emacs setup</a></li>
<li><a href="#sec-2">2. Set personal information</a></li>
<li><a href="#sec-3">3. Utility function definitions</a></li>
<li><a href="#sec-4">4. Package setup</a></li>
<li><a href="#sec-5">5. Include sensible-defaults.el</a></li>
<li><a href="#sec-6">6. Quality of life improvements</a></li>
<li><a href="#sec-7">7. Version control highlighting</a></li>
<li><a href="#sec-8">8. Set up evil-mode</a></li>
<li><a href="#sec-9">9. Use powerline</a></li>
<li><a href="#sec-10">10. Set up org-mode</a></li>
<li><a href="#sec-11">11. Set up helm</a></li>
<li><a href="#sec-12">12. Use company-mode</a></li>
<li><a href="#sec-13">13. Language specific setup</a>
<ul>
<li><a href="#sec-13-1">13.1. Rust</a></li>
<li><a href="#sec-13-2">13.2. Python</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> General emacs setup</h2>
<div class="outline-text-2" id="text-1">
<p>
Neither scrollbars nor a tool/menu bar are relevant when you have a keyboard.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(global-hl-line-mode)
(set-default-font <span style="color: #a8c194; font-weight: bold; font-style: italic;">"Operator Mono 12"</span>)
(<span style="color: #859900; font-weight: bold;">setq</span> ring-bell-function 'ignore)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Set personal information</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #859900; font-weight: bold;">setq</span> user-full-name <span style="color: #a8c194; font-weight: bold; font-style: italic;">"Maxfield Lehman"</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Utility function definitions</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">kill-matching-lines</span> (regexp <span style="color: #b58900;">&amp;optional</span> rstart rend interactive)
<span style="color: #2aa198;">"Kill lines containing matches for REGEXP.</span>

<span style="color: #2aa198;">See `</span><span style="color: #268bd2; font-weight: bold;">flush-lines</span><span style="color: #2aa198;">' or `</span><span style="color: #268bd2; font-weight: bold;">keep-lines</span><span style="color: #2aa198;">' for behavior of this command.</span>

<span style="color: #2aa198;">If the buffer is read-only, Emacs will beep and refrain from deleting</span>
<span style="color: #2aa198;">the line, but put the line in the kill ring anyway.  This means that</span>
<span style="color: #2aa198;">you can use this command to copy text from a read-only buffer.</span>
<span style="color: #2aa198;">\(If the variable `</span><span style="color: #268bd2; font-weight: bold;">kill-read-only-ok</span><span style="color: #2aa198;">' is non-nil, then this won't</span>
<span style="color: #2aa198;">even beep.)"</span>
(<span style="color: #859900; font-weight: bold;">interactive</span>
(keep-lines-read-args <span style="color: #a8c194; font-weight: bold; font-style: italic;">"Kill lines containing match for regexp"</span>))
(<span style="color: #859900; font-weight: bold;">let</span> ((buffer-file-name nil)) <span style="color: #586e75;">;; </span><span style="color: #63747c; font-style: italic;">HACK for `</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">clone-buffer</span><span style="color: #63747c; font-style: italic;">'</span>
    (<span style="color: #859900; font-weight: bold;">with-current-buffer</span> (clone-buffer nil nil)
    (<span style="color: #859900; font-weight: bold;">let</span> ((inhibit-read-only t))
        (keep-lines regexp rstart rend interactive)
        (kill-region (<span style="color: #859900; font-weight: bold;">or</span> rstart (line-beginning-position))
                    (<span style="color: #859900; font-weight: bold;">or</span> rend (point-max))))
    (kill-buffer)))
(<span style="color: #859900; font-weight: bold;">unless</span> (<span style="color: #859900; font-weight: bold;">and</span> buffer-read-only kill-read-only-ok)
    <span style="color: #586e75;">;; </span><span style="color: #63747c; font-style: italic;">Delete lines or make the "Buffer is read-only" error.</span>
    (flush-lines regexp rstart rend interactive)))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Package setup</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">package</span>)

(add-to-list 'package-archives '(<span style="color: #a8c194; font-weight: bold; font-style: italic;">"org"</span> . <span style="color: #a8c194; font-weight: bold; font-style: italic;">"http://orgmode.org/elpa/"</span>))
(add-to-list 'package-archives '(<span style="color: #a8c194; font-weight: bold; font-style: italic;">"melpa"</span> . <span style="color: #a8c194; font-weight: bold; font-style: italic;">"http://melpa.org/packages/"</span>))
(add-to-list 'package-archives '(<span style="color: #a8c194; font-weight: bold; font-style: italic;">"melpa-stable"</span> . <span style="color: #a8c194; font-weight: bold; font-style: italic;">"http://stable.melpa.org/packages/"</span>))

(<span style="color: #859900; font-weight: bold;">setq</span> package-enable-at-startup nil)
(package-initialize)

(<span style="color: #859900; font-weight: bold;">unless</span> (package-installed-p 'use-package)
(package-refresh-contents)
(package-install 'use-package))

(<span style="color: #859900; font-weight: bold;">eval-when-compile</span>
    (<span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">use-package</span>))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Include sensible-defaults.el</h2>
<div class="outline-text-2" id="text-5">
<p>
The settings (not keybindings) seem mostly inocuous and better choices.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(load-file <span style="color: #a8c194; font-weight: bold; font-style: italic;">"~/.emacs.d/sensible-defaults.el"</span>)
(sensible-defaults/use-all-settings)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Quality of life improvements</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #859900; font-weight: bold;">setq-default</span> indent-tabs-mode nil)
(<span style="color: #859900; font-weight: bold;">setq</span> tab-width 4)
(<span style="color: #859900; font-weight: bold;">setq-default</span> c-basic-offset 'tab-width)
(<span style="color: #859900; font-weight: bold;">defvaralias</span> '<span style="color: #268bd2;">cperl-indent-level</span> 'tab-width)
(electric-indent-mode 1)
(electric-pair-mode 1)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Version control highlighting</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-diff-hl-mode)
(diff-hl-flydiff-mode)
(add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Set up evil-mode</h2>
<div class="outline-text-2" id="text-8">
<p>
Evil is a necessity for any real editing.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">evil</span>)
(evil-mode t)
(global-evil-leader-mode)
(evil-leader/set-leader <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&lt;SPC&gt;"</span>)
(evil-leader/set-key <span style="color: #a8c194; font-weight: bold; font-style: italic;">"k"</span> 'kill-buffer)
(evil-commentary-mode)
(global-evil-surround-mode t)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Use powerline</h2>
<div class="outline-text-2" id="text-9">
<p>
Cool fonts upset the nice themes though.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">powerline</span>)
(powerline-center-evil-theme)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Set up org-mode</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #a8c194; font-weight: bold; font-style: italic;">"~/dev/github/org-mode/lisp"</span> t)
(add-hook 'org-mode-hook (<span style="color: #859900; font-weight: bold;">lambda</span> () (org-bullets-mode 1)))
(<span style="color: #859900; font-weight: bold;">setq</span> org-src-fontify-natively t)
(<span style="color: #859900; font-weight: bold;">setq</span> org-export-latex-listings t)
(<span style="color: #859900; font-weight: bold;">setq</span> org-ellipsis <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#10549;"</span>)
(<span style="color: #859900; font-weight: bold;">setq</span> org-src-tab-acts-natively t)
(<span style="color: #859900; font-weight: bold;">setq</span> org-bullets-bullet-list '(<span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9675;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9737;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9678;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9673;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9675;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9676;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9678;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9679;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9702;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9711;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9898;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9899;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#9900;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#10061;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#65518;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#8857;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#8858;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#8859;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#8729;"</span> <span style="color: #a8c194; font-weight: bold; font-style: italic;">"&#8728;"</span>))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Set up helm</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">helm</span>
    <span style="color: #839496; font-weight: bold;">:ensure</span> t)
(global-set-key (kbd <span style="color: #a8c194; font-weight: bold; font-style: italic;">"M-x"</span>) 'helm-M-x)
(global-set-key (kbd <span style="color: #a8c194; font-weight: bold; font-style: italic;">"C-x C-f"</span>) #'helm-find-files)
(helm-mode 1)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Use company-mode</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'global-company-mode)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Language specific setup</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Rust</h3>
<div class="outline-text-3" id="text-13-1">
<p>
It's always good to be optimistic about learning Rust.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'rust-mode-hook 'cargo-minor-mode)
(evil-leader/set-key-for-mode 'rust-mode <span style="color: #a8c194; font-weight: bold; font-style: italic;">"f"</span> 'rust-format-buffer)
(<span style="color: #859900; font-weight: bold;">setq</span> racer-cmd <span style="color: #a8c194; font-weight: bold; font-style: italic;">"~/.cargo/bin/racer"</span>) <span style="color: #586e75;">;; </span><span style="color: #63747c; font-style: italic;">Rustup binaries PATH</span>
(<span style="color: #859900; font-weight: bold;">setq</span> racer-rust-src-path <span style="color: #a8c194; font-weight: bold; font-style: italic;">"/Users/Max/.multirust/toolchains/stable-x86_64-apple-darwin/lib/rustlib/src/rust/src"</span>) <span style="color: #586e75;">;; </span><span style="color: #63747c; font-style: italic;">Rust source code PATH</span>

(add-hook 'rust-mode-hook #'racer-mode)
(add-hook 'racer-mode-hook #'eldoc-mode)
(add-hook 'racer-mode-hook #'company-mode)
(add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> Python</h3>
<div class="outline-text-3" id="text-13-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'python-mode-hook 'anaconda-eldoc-mode)
(add-hook 'python-mode-hook 'anaconda-mode)
(eval-after-load <span style="color: #a8c194; font-weight: bold; font-style: italic;">"company"</span>
'(add-to-list 'company-backends 'company-anaconda))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Maxfield Lehman</p>
<p class="date">Created: 2017-02-13 Mon 12:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
